src/DataProcessors/МФГенерацияАвтотестов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>МФГенерацияАвтотестов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяСуществующейИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйПутьКФайлуРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСуществующейИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуЗапуска1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРаботыГенерацииРасширения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСоединенияКСуществующейИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьМодулиСТестами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьМодулиЯдраТестирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/МФГенерацияАвтотестов/Ext/ManagerModule.bsl
//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИменаПараметровГенерацииРасширения() Экспорт
	Результат = Новый Массив;
	
	Результат.Добавить("ПутьКФайлуЗапуска1С");
	Результат.Добавить("ВидИнформационнойБазы");
	Результат.Добавить("СтрокаСоединенияКСуществующейИБ");
	Результат.Добавить("ПользовательСуществующейИБ");
	Результат.Добавить("ПарольПользователяСуществующейИБ");
	Результат.Добавить("ИмяРасширения");
	
	Возврат СтрСоединить(Результат, ",");
КонецФункции

Функция ИменаСвойствГенерацииРасширения() Экспорт;
	Результат = Новый Массив;
	
	//Результат.Добавить("ДоступностьФормироватьМодулиСТестами");
	Результат.Добавить("ИмяРасширения");
	Результат.Добавить("ПолныйПутьКФайлуРасширения");
	//Результат.Добавить("РежимРаботыГенерацииРасширения");
	//Результат.Добавить("ТекущаяВерсияРасширения");
	Результат.Добавить("ФормироватьМодулиСТестами");
	Результат.Добавить("ФормироватьМодулиЯдраТестирования");
	
	Возврат СтрСоединить(Результат, ",");
КонецФункции

Функция СвойстваРасширения(ДвоичныеДанные) Экспорт
	Результат = Новый Структура("Имя, Версия");
	Попытка
		РасширениеСТестами = РасширенияКонфигурации.Создать(ДвоичныеДанные);
		Результат.Имя = РасширениеСТестами.Имя;
		Результат.Версия = РасширениеСТестами.Версия;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
